nico-malkov/variometer/software/nRF5_SDK_17.1.0/examples/peripheral/variometer_v143/icm20948/invensense/DeviceIcm20948.c
/*
 * ________________________________________________________________________________________________________
 * Copyright (c) 2015-2015 InvenSense Inc. All rights reserved.
 *
 * This software, related documentation and any modifications thereto (collectively “Software”) is subject
 * to InvenSense and its licensors' intellectual property rights under U.S. and international copyright
 * and other intellectual property rights laws.
 *
 * InvenSense and its licensors retain all intellectual property and proprietary rights in and to the Software
 * and any use, reproduction, disclosure or distribution of the Software without an express license agreement
 * from InvenSense is strictly prohibited.
 *
 * EXCEPT AS OTHERWISE PROVIDED IN A LICENSE AGREEMENT BETWEEN THE PARTIES, THE SOFTWARE IS
 * PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
 * TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT.
 * EXCEPT AS OTHERWISE PROVIDED IN A LICENSE AGREEMENT BETWEEN THE PARTIES, IN NO EVENT SHALL
 * INVENSENSE BE LIABLE FOR ANY DIRECT, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, OR ANY
 * DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,
 * NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE
 * OF THE SOFTWARE.
 * ________________________________________________________________________________________________________
 */

#include "DeviceIcm20948.h"
#include "InvExport.h"
#include "nrf_delay.h"
#include "nrf_log.h"
//#include "Message.h"

static const inv_device_vt_t device_icm20948_vt = {
    inv_device_icm20948_whoami,
    inv_device_icm20948_reset,
    inv_device_icm20948_setup,
    inv_device_icm20948_cleanup,
    inv_device_icm20948_load,
    inv_device_icm20948_poll,
    inv_device_icm20948_self_test,
    0, // inv_device_icm20948_get_fw_info,
    inv_device_icm20948_ping_sensor,
    0, // inv_device_icm20948_set_running_state,
    inv_device_icm20948_enable_sensor,
    inv_device_icm20948_set_sensor_period_us,
    inv_device_icm20948_set_sensor_timeout,
    0, // inv_device_icm20948_flush_sensor,
    0, // inv_device_icm20948_set_sensor_bias,
    0, // inv_device_icm20948_get_sensor_bias,
    inv_device_icm20948_set_sensor_mounting_matrix,
    0, //inv_device_icm20948_get_sensor_data, //
    inv_device_icm20948_set_sensor_config,
    inv_device_icm20948_get_sensor_config,
    inv_device_icm20948_write_mems_register,
    inv_device_icm20948_read_mems_register,
};

static enum inv_icm20948_sensor idd_sensortype_2_driver(int sensor) {
  switch (sensor) {
  case INV_SENSOR_TYPE_RAW_ACCELEROMETER:
    return INV_ICM20948_SENSOR_RAW_ACCELEROMETER;
  case INV_SENSOR_TYPE_RAW_GYROSCOPE:
    return INV_ICM20948_SENSOR_RAW_GYROSCOPE;
  case INV_SENSOR_TYPE_ACCELEROMETER:
    return INV_ICM20948_SENSOR_ACCELEROMETER;
  case INV_SENSOR_TYPE_GYROSCOPE:
    return INV_ICM20948_SENSOR_GYROSCOPE;
  case INV_SENSOR_TYPE_UNCAL_MAGNETOMETER:
    return INV_ICM20948_SENSOR_MAGNETIC_FIELD_UNCALIBRATED;
  case INV_SENSOR_TYPE_UNCAL_GYROSCOPE:
    return INV_ICM20948_SENSOR_GYROSCOPE_UNCALIBRATED;
  case INV_SENSOR_TYPE_BAC:
    return INV_ICM20948_SENSOR_ACTIVITY_CLASSIFICATON;
  case INV_SENSOR_TYPE_STEP_DETECTOR:
    return INV_ICM20948_SENSOR_STEP_DETECTOR;
  case INV_SENSOR_TYPE_STEP_COUNTER:
    return INV_ICM20948_SENSOR_STEP_COUNTER;
  case INV_SENSOR_TYPE_GAME_ROTATION_VECTOR:
    return INV_ICM20948_SENSOR_GAME_ROTATION_VECTOR;
  case INV_SENSOR_TYPE_ROTATION_VECTOR:
    return INV_ICM20948_SENSOR_ROTATION_VECTOR;
  case INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR:
    return INV_ICM20948_SENSOR_GEOMAGNETIC_ROTATION_VECTOR;
  case INV_SENSOR_TYPE_MAGNETOMETER:
    return INV_ICM20948_SENSOR_GEOMAGNETIC_FIELD;
  case INV_SENSOR_TYPE_SMD:
    return INV_ICM20948_SENSOR_WAKEUP_SIGNIFICANT_MOTION;
  case INV_SENSOR_TYPE_PICK_UP_GESTURE:
    return INV_ICM20948_SENSOR_FLIP_PICKUP;
  case INV_SENSOR_TYPE_TILT_DETECTOR:
    return INV_ICM20948_SENSOR_WAKEUP_TILT_DETECTOR;
  case INV_SENSOR_TYPE_GRAVITY:
    return INV_ICM20948_SENSOR_GRAVITY;
  case INV_SENSOR_TYPE_LINEAR_ACCELERATION:
    return INV_ICM20948_SENSOR_LINEAR_ACCELERATION;
  case INV_SENSOR_TYPE_ORIENTATION:
    return INV_ICM20948_SENSOR_ORIENTATION;
  case INV_SENSOR_TYPE_B2S:
    return INV_ICM20948_SENSOR_B2S;
  default:
    return INV_ICM20948_SENSOR_MAX;
  }
}

static int idd_driver_2_sensortype(enum inv_icm20948_sensor sensor) {
  switch (sensor) {
  case INV_ICM20948_SENSOR_ACCELEROMETER:
    return INV_SENSOR_TYPE_ACCELEROMETER;
  case INV_ICM20948_SENSOR_GYROSCOPE:
    return INV_SENSOR_TYPE_GYROSCOPE;
  case INV_ICM20948_SENSOR_RAW_ACCELEROMETER:
    return INV_SENSOR_TYPE_RAW_ACCELEROMETER;
  case INV_ICM20948_SENSOR_RAW_GYROSCOPE:
    return INV_SENSOR_TYPE_RAW_GYROSCOPE;
  case INV_ICM20948_SENSOR_MAGNETIC_FIELD_UNCALIBRATED:
    return INV_SENSOR_TYPE_UNCAL_MAGNETOMETER;
  case INV_ICM20948_SENSOR_GYROSCOPE_UNCALIBRATED:
    return INV_SENSOR_TYPE_UNCAL_GYROSCOPE;
  case INV_ICM20948_SENSOR_ACTIVITY_CLASSIFICATON:
    return INV_SENSOR_TYPE_BAC;
  case INV_ICM20948_SENSOR_STEP_DETECTOR:
    return INV_SENSOR_TYPE_STEP_DETECTOR;
  case INV_ICM20948_SENSOR_STEP_COUNTER:
    return INV_SENSOR_TYPE_STEP_COUNTER;
  case INV_ICM20948_SENSOR_GAME_ROTATION_VECTOR:
    return INV_SENSOR_TYPE_GAME_ROTATION_VECTOR;
  case INV_ICM20948_SENSOR_ROTATION_VECTOR:
    return INV_SENSOR_TYPE_ROTATION_VECTOR;
  case INV_ICM20948_SENSOR_GEOMAGNETIC_ROTATION_VECTOR:
    return INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR;
  case INV_ICM20948_SENSOR_GEOMAGNETIC_FIELD:
    return INV_SENSOR_TYPE_MAGNETOMETER;
  case INV_ICM20948_SENSOR_WAKEUP_SIGNIFICANT_MOTION:
    return INV_SENSOR_TYPE_SMD;
  case INV_ICM20948_SENSOR_FLIP_PICKUP:
    return INV_SENSOR_TYPE_PICK_UP_GESTURE;
  case INV_ICM20948_SENSOR_WAKEUP_TILT_DETECTOR:
    return INV_SENSOR_TYPE_TILT_DETECTOR;
  case INV_ICM20948_SENSOR_GRAVITY:
    return INV_SENSOR_TYPE_GRAVITY;
  case INV_ICM20948_SENSOR_LINEAR_ACCELERATION:
    return INV_SENSOR_TYPE_LINEAR_ACCELERATION;
  case INV_ICM20948_SENSOR_ORIENTATION:
    return INV_SENSOR_TYPE_ORIENTATION;
  case INV_ICM20948_SENSOR_B2S:
    return INV_SENSOR_TYPE_B2S;
  default:
    return INV_SENSOR_TYPE_MAX;
  }
}

static void data_handler(void *context, enum inv_icm20948_sensor sensor, uint64_t timestamp,
    const void *data, const void *arg);

