nico-malkov/variometer/software/nRF5_SDK_17.1.0/examples/peripheral/variometer_v143/icm20948/invensense/DeviceIcm20948.c
static inv_bool_t build_sensor_event(inv_device_icm20948_t *self,
    int sensorid, uint64_t timestamp, const void *data, const void *arg,
    inv_sensor_event_t *event);

static int host_serif_read_reg_legacy(void *context, uint8_t reg, uint8_t *data, uint32_t len) {
  inv_host_serif_t *serif = (inv_host_serif_t *)context;

  return serif->read_reg(reg, data, len);
}

/* For BW compatibility
 * wrapper function to adapt prototype of write_reg() as defined in inv_host_serif
 * to expected prototype for inv_serif_hal
 */
static int host_serif_write_reg_legacy(void *context, uint8_t reg, uint8_t *data, uint32_t len) {
  inv_host_serif_t *serif = (inv_host_serif_t *)context;

  return serif->write_reg(reg, data, len);
}

void inv_device_icm20948_init(inv_device_icm20948_t *self,
    const inv_host_serif_t *serif, const inv_sensor_listener_t *listener,
    const uint8_t *dmp3_image, uint32_t dmp3_image_size) {
  /* create an a inv_serif_hal_t object from a inv_host_serif_t */
  const inv_serif_hal_t serif_hal = {
      host_serif_read_reg_legacy, host_serif_write_reg_legacy, /* use small wrappers to adapt prototype */
      serif->max_read_size, serif->max_write_size,
      serif->serif_type, &self->legacy_serif};

  /* call the 'constructor' */
  inv_device_icm20948_init2(self, &serif_hal, listener, dmp3_image, dmp3_image_size);
  /* keep a copy of the user inv_host_serif_t (used in the _legacy callbacks) */
  self->legacy_serif = *serif;
}

void inv_device_icm20948_init2(inv_device_icm20948_t *self,
    const inv_serif_hal_t *serif, const inv_sensor_listener_t *listener,
    const uint8_t *dmp3_image, uint32_t dmp3_image_size) {
  struct inv_icm20948_serif icm20948_serif;

  assert(self);

  memset(self, 0, sizeof(*self));

  /* initialize icm20948 serif structure */
  icm20948_serif.context = serif->context;
  icm20948_serif.read_reg = serif->read_reg;
  icm20948_serif.write_reg = serif->write_reg;
  icm20948_serif.max_read = serif->max_read_transaction_size;
  icm20948_serif.max_write = serif->max_write_transaction_size;
  icm20948_serif.is_spi = !!(serif->serif_type == INV_SERIF_HAL_TYPE_SPI);

  /* build base */
  self->base.instance = self;
  self->base.vt = &device_icm20948_vt;
  self->base.listener = listener;
  self->dmp3_image = dmp3_image;
  self->dmp3_image_size = dmp3_image_size;
  /* reset icm20948 driver states */
  inv_icm20948_reset_states(&self->icm20948_states, &icm20948_serif);

  /* initialise mounting matrix to identity */

  self->icm20948_states.mounting_matrix[0] = 1;
  self->icm20948_states.mounting_matrix[4] = 1;
  self->icm20948_states.mounting_matrix[8] = 1;

  /*initialise base state structure*/
  inv_icm20948_init_structure(&self->icm20948_states);

#if (IMU_CHIP == HW_ICM20948)
  /*force the usage of akm9916 for 20948*/
  inv_device_icm20948_init_aux_compass(self, INV_ICM20948_COMPASS_ID_AK09916, 0x0C);
  //NRF_LOG_INFO("Init auxiliary compass AK09916");
  nrf_delay_ms(10);

#endif
}

int inv_device_icm20948_poll(void *context) { // NRF_LOG_DEBUG("inv_device_icm20948_poll");
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  return inv_icm20948_poll_sensor(&self->icm20948_states, self, data_handler);
}

int inv_device_icm20948_whoami(void *context, uint8_t *whoami) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  assert(whoami);

  return inv_icm20948_get_whoami(&self->icm20948_states, whoami);
}

int inv_device_icm20948_reset(void *context) {
  int rc = 0;

  // INV_MSG(INV_MSG_LEVEL_VERBOSE, "Reseting device...");
  rc |= inv_device_icm20948_cleanup(context);
  rc |= inv_device_icm20948_setup(context);

  if (rc != 0) {
    // INV_MSG(INV_MSG_LEVEL_ERROR, "Icm20648 reset returned %d", rc);
    return rc;
  }

  return 0;
}

int inv_device_icm20948_setup(void *context) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  int rc;
  uint8_t whoami;

  // INV_MSG(INV_MSG_LEVEL_INFO, "Booting up Icm20948...");

  /* Check WHOAMI */
  // INV_MSG(INV_MSG_LEVEL_VERBOSE, "Reading WHOAMI...");
  if ((rc = inv_device_icm20948_whoami(self, &whoami)) != 0) {
    // INV_MSG(INV_MSG_LEVEL_ERROR, "Error %d when reading WHOAMI value", rc);
    NRF_LOG_ERROR("Error %d when reading WHOAMI value", rc);

    return rc;
  }

  /*if (whoami != 0x0EA) { // ICM@0948
    NRF_LOG_ERROR("Unexpected WHOAMI value 0x%x. Try turn off and on...", whoami);
    return INV_ERROR;
  } else {
    NRF_LOG_INFO("ICM WHOAMI value: 0X%02X ", whoami);
    // sprintf(ESBstring, "MPU who I am  (should be 0xEA): 0X%02X ,%d", whoami,  "Init error : ", rc);
    //  ESBsend();
  }*/
  // Setup accel and gyro mounting matrix and associated angle for current board
  inv_icm20948_init_matrix(&self->icm20948_states);

  // set default power mode
  // INV_MSG(INV_MSG_LEVEL_VERBOSE, "Putting Icm20948 in sleep mode...");
  if ((rc = inv_icm20948_initialize(&self->icm20948_states, self->dmp3_image,
           self->dmp3_image_size)) != 0)
    goto error;

  // Initialize auxiliary sensors
  inv_icm20948_initialize_auxiliary(&self->icm20948_states);

  inv_icm20948_init_scale(&self->icm20948_states);

  // re-initialise base state structure
  inv_icm20948_init_structure(&self->icm20948_states);

  // we should be good to go !
  //NRF_LOG_INFO("We're good to go !");
  //  ESBsend("OK");

  return 0;
error:
  // INV_MSG(INV_MSG_LEVEL_ERROR, "Error %d while setting-up device.", rc);

  return rc;
}

int inv_device_icm20948_cleanup(void *context) {
  int i = 0;
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  /* Disable all supported sensors */
  for (i = 0; i < INV_SENSOR_TYPE_MAX; ++i) {
    if (inv_device_icm20948_ping_sensor(context, i) == 0)
      inv_device_icm20948_enable_sensor(context, i, 0);
  }

  return inv_icm20948_soft_reset(&self->icm20948_states);
}

int inv_device_icm20948_load(void *context, int what,
    const uint8_t *image, uint32_t size, inv_bool_t verify, inv_bool_t force) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  (void)what;
  (void)verify;
  (void)force;

