nico-malkov/variometer/software/nRF5_SDK_17.1.0/examples/peripheral/variometer_v143/icm20948/invensense/DeviceIcm20948.c
  return inv_icm20948_load(&self->icm20948_states, image, size);
}

int inv_device_icm20948_self_test(void *context, int sensor) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  int rc;

  if (inv_device_icm20948_ping_sensor(context, sensor) != 0)
    return INV_ERROR_BAD_ARG;

  if ((sensor != INV_SENSOR_TYPE_RAW_ACCELEROMETER) &&
      (sensor != INV_SENSOR_TYPE_ACCELEROMETER) &&
      (sensor != INV_SENSOR_TYPE_RAW_GYROSCOPE) &&
      (sensor != INV_SENSOR_TYPE_GYROSCOPE) &&
      (sensor != INV_SENSOR_TYPE_MAGNETOMETER))
    //(sensor != INV_SENSOR_TYPE_RAW_MAGNETOMETER) AxL add rawmag
    return INV_ERROR_BAD_ARG;

  if (self->icm20948_states.selftest_done) {
    NRF_LOG_INFO("Self-test already ran once!");
    return INV_ERROR_SUCCESS;
  }

  /* Reset the device in case the self-test doesn't run at start */
  inv_device_icm20948_cleanup(context);
  if ((inv_icm20948_run_selftest(&self->icm20948_states) & INV_ICM20948_SELF_TEST_OK) == INV_ICM20948_SELF_TEST_OK) {
    self->icm20948_states.selftest_done = 1;
    rc = 0;
  } else
    rc = INV_ERROR;

  /* It's advised to re-init the device after self-test for normal use */
  inv_device_icm20948_reset(context);
  return rc;
}

int inv_device_icm20948_ping_sensor(void *context, int sensor) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  /* HW sensors */
  if ((sensor == INV_SENSOR_TYPE_RAW_ACCELEROMETER) ||
      (sensor == INV_SENSOR_TYPE_RAW_GYROSCOPE) ||
      (sensor == INV_SENSOR_TYPE_GAME_ROTATION_VECTOR) ||
      (sensor == INV_SENSOR_TYPE_ACCELEROMETER) ||
      (sensor == INV_SENSOR_TYPE_GYROSCOPE) ||
      (sensor == INV_SENSOR_TYPE_UNCAL_GYROSCOPE) ||
      (sensor == INV_SENSOR_TYPE_SMD) ||
      (sensor == INV_SENSOR_TYPE_STEP_DETECTOR) ||
      (sensor == INV_SENSOR_TYPE_STEP_COUNTER) ||
      (sensor == INV_SENSOR_TYPE_B2S) ||
      (sensor == INV_SENSOR_TYPE_PICK_UP_GESTURE) ||
      (sensor == INV_SENSOR_TYPE_BAC) ||
      (sensor == INV_SENSOR_TYPE_GRAVITY) ||
      (sensor == INV_SENSOR_TYPE_LINEAR_ACCELERATION) ||
      (sensor == INV_SENSOR_TYPE_TILT_DETECTOR)) {
    return 0;
  } else if ((sensor == INV_SENSOR_TYPE_MAGNETOMETER) ||
             (sensor == INV_SENSOR_TYPE_UNCAL_MAGNETOMETER) ||
             (sensor == INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR) ||
             (sensor == INV_SENSOR_TYPE_ORIENTATION) ||
             (sensor == INV_SENSOR_TYPE_ROTATION_VECTOR)) {
    if (inv_icm20948_compass_isconnected(&self->icm20948_states))
      return 0;
  }

  return INV_ERROR_BAD_ARG;
}

int inv_device_icm20948_enable_sensor(void *context, int sensor, inv_bool_t en) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  return inv_icm20948_enable_sensor(&self->icm20948_states, idd_sensortype_2_driver(sensor), en);
}

int inv_device_icm20948_set_sensor_period_us(void *context,
    int sensor, uint32_t period) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  /* convert period back to ms as this is what expects the driver for now */
  period /= 1000;

  return inv_icm20948_set_sensor_period(&self->icm20948_states, idd_sensortype_2_driver(sensor), period);
}

int inv_device_icm20948_set_sensor_timeout(void *context,
    int sensor, uint32_t period) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  (void)sensor;

  return inv_icm20948_enable_batch_timeout(&self->icm20948_states, period);
}

//*******SL

// int inv_device_icm20948_get_sensor_bias(void * context, int sensor, float bias[3])
//{ return inv_icm20948_get_bias(&self->icm20948_states, idd_sensortype_2_driver(sensor), value_out);}

//*******SL

int inv_device_icm20948_set_sensor_mounting_matrix(void *context,
    int sensor, const float matrix[9]) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  return inv_icm20948_set_matrix(&self->icm20948_states, matrix, idd_sensortype_2_driver(sensor));
}

int inv_device_icm20948_write_mems_register(void *context, int sensor, uint16_t reg_addr,
    const void *data, unsigned size) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  (void)sensor;

  return inv_icm20948_write_reg(&self->icm20948_states, (uint8_t)reg_addr, (uint8_t *)data, size);
}

int inv_device_icm20948_read_mems_register(void *context, int sensor, uint16_t reg_addr,
    void *data, unsigned size) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;

  (void)sensor;

  return inv_icm20948_read_reg(&self->icm20948_states, (uint8_t)reg_addr, (uint8_t *)data, size);
}

void inv_device_icm20948_init_aux_compass(inv_device_icm20948_t *self,
    int aux_compass_id, uint8_t aux_compass_addr) {
  /* register auxiliary compass (assuming AK09911) */
  //  NRF_LOG_INFO("inv_icm20948_register_aux_compass");
  nrf_delay_ms(10);
  inv_icm20948_register_aux_compass(&self->icm20948_states,
      (enum inv_icm20948_compass_id)aux_compass_id, aux_compass_addr);
  nrf_delay_ms(10);
  //   NRF_LOG_INFO("inv_icm20948_register_aux_compass2");
}

int inv_device_icm20948_set_sensor_config(void *context, int sensor, int setting,
    const void *value, unsigned size) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  int rc = 0;
  (void)size;

  switch (setting) {
  case INV_DEVICE_ICM20948_CONFIG_FSR: {
    int temp_bias[3];
    // In case FSR change, we save and apply new bias
    inv_icm20948_get_bias(&self->icm20948_states, idd_sensortype_2_driver(sensor), temp_bias);
    rc = inv_icm20948_set_fsr(&self->icm20948_states, idd_sensortype_2_driver(sensor), value);
    inv_icm20948_set_bias(&self->icm20948_states, idd_sensortype_2_driver(sensor), temp_bias);
    break;
  }
  case INV_DEVICE_ICM20948_CONFIG_POWER_MODE:
    return inv_icm20948_set_lowpower_or_highperformance(&self->icm20948_states, *((uint8_t *)value));
  case INV_DEVICE_ICM20948_CONFIG_OFFSET:
    return inv_icm20948_set_bias(&self->icm20948_states, idd_sensortype_2_driver(sensor), value);
  /*case INV_DEVICE_ICM20948_CONFIG_WOM_THRESHOLD: //AxL
          switch(sensor) {
          case INV_SENSOR_TYPE_WOM:
                  return inv_icm20948_set_wom_threshold(&self->icm20948_states, (uint8_t)(*(const inv_device_icm20948_config_wom_threshold_t *)value));
          default:
                  return -1;
          }*/
  default:
    return -1;
  }
  return rc;
}

int inv_device_icm20948_get_sensor_config(void *context, int sensor, int setting,
    void *value_out, unsigned size) {
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  (void)size;
  switch (setting) {
  case INV_DEVICE_ICM20948_CONFIG_FSR:
    return inv_icm20948_get_fsr(&self->icm20948_states, idd_sensortype_2_driver(sensor), value_out);
  case INV_DEVICE_ICM20948_CONFIG_POWER_MODE:
    return inv_icm20948_get_lowpower_or_highperformance(&self->icm20948_states, value_out);
  case INV_DEVICE_ICM20948_CONFIG_OFFSET:
    return inv_icm20948_get_bias(&self->icm20948_states, idd_sensortype_2_driver(sensor), value_out);
  default:
    return -1;
  }
}
/******************************************************************************/

static void data_handler(void *context, enum inv_icm20948_sensor sensor, uint64_t timestamp,
    const void *data, const void *arg) { // NRF_LOG_DEBUG("data_handler");
  inv_device_icm20948_t *self = (inv_device_icm20948_t *)context;
  inv_sensor_event_t event;
  const int sensortype = idd_driver_2_sensortype(sensor);

  if (build_sensor_event(self, sensortype, timestamp, data, arg, &event)) {
    inv_sensor_listener_notify(self->base.listener, &event);
  }
}

static inv_bool_t build_sensor_event_data(inv_device_icm20948_t *self,
    uint8_t sensortype, const void *data, const void *arg,
    inv_sensor_event_t *event) { // NRF_LOG_DEBUG("build_sensor_event_data");
  float raw_bias_data[6];
  // char ESBstring[64];  //*************
  (void)self;

  switch (sensortype) {
  case INV_SENSOR_TYPE_UNCAL_GYROSCOPE:

    memcpy(raw_bias_data, data, sizeof(raw_bias_data));
    memcpy(event->data.gyr.vect, &raw_bias_data[0], sizeof(event->data.gyr.vect));
    memcpy(event->data.gyr.bias, &raw_bias_data[3], sizeof(event->data.gyr.bias));
    memcpy(&(event->data.gyr.accuracy_flag), arg, sizeof(event->data.gyr.accuracy_flag));
    break;
  case INV_SENSOR_TYPE_UNCAL_MAGNETOMETER:
    memcpy(raw_bias_data, data, sizeof(raw_bias_data));
    memcpy(event->data.mag.vect, &raw_bias_data[0], sizeof(event->data.mag.vect));
    memcpy(event->data.mag.bias, &raw_bias_data[3], sizeof(event->data.mag.bias));
    memcpy(&(event->data.gyr.accuracy_flag), arg, sizeof(event->data.gyr.accuracy_flag));

    /* sprintf(ESBstring, "%.4f, %.4f, %.4f",raw_bias_data[0], raw_bias_data[1], raw_bias_data[2]);  ////*********
      NRF_LOG_RAW_INFO("UNCAL_MAGNETO data: %s\n", ESBstring);  //**********

      sprintf(ESBstring, "%.4f, %.4f, %.4f",event->data.mag.vect[0], event->data.mag.vect[1], event->data.mag.vect[2]);  ////*********
      NRF_LOG_RAW_INFO("UNCAL_MAGNETO vect: %s\n", ESBstring);
      sprintf(ESBstring, " %.4f, %.4f, %.4f",event->data.mag.bias[0], event->data.mag.bias[1], event->data.mag.bias[2]);  ////*********
      NRF_LOG_RAW_INFO( "Mag_biais : %s\n", ESBstring); */

    break;
  case INV_SENSOR_TYPE_GYROSCOPE:
    memcpy(event->data.gyr.vect, data, sizeof(event->data.gyr.vect));
    memcpy(&(event->data.gyr.accuracy_flag), arg, sizeof(event->data.gyr.accuracy_flag));
    break;
  case INV_SENSOR_TYPE_GRAVITY:
  case INV_SENSOR_TYPE_LINEAR_ACCELERATION:
  case INV_SENSOR_TYPE_ACCELEROMETER:
    memcpy(event->data.acc.vect, data, sizeof(event->data.acc.vect));
    memcpy(&(event->data.acc.accuracy_flag), arg, sizeof(event->data.acc.accuracy_flag));
    break;
  case INV_SENSOR_TYPE_MAGNETOMETER:
    memcpy(event->data.mag.vect, data, sizeof(event->data.mag.vect));
    memcpy(&(event->data.mag.accuracy_flag), arg, sizeof(event->data.mag.accuracy_flag));
    break;
  case INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR:
  case INV_SENSOR_TYPE_ROTATION_VECTOR:
    memcpy(&(event->data.quaternion.accuracy), arg, sizeof(event->data.quaternion.accuracy));
    memcpy(event->data.quaternion.quat, data, sizeof(event->data.quaternion.quat));
    break;
  case INV_SENSOR_TYPE_GAME_ROTATION_VECTOR:
    memcpy(event->data.quaternion.quat, data, sizeof(event->data.quaternion.quat));
    break;
  case INV_SENSOR_TYPE_BAC:
    memcpy(&(event->data.bac.event), data, sizeof(event->data.bac.event));
    break;
  case INV_SENSOR_TYPE_PICK_UP_GESTURE:
  case INV_SENSOR_TYPE_TILT_DETECTOR:
  case INV_SENSOR_TYPE_STEP_DETECTOR:
  case INV_SENSOR_TYPE_SMD:
  case INV_SENSOR_TYPE_B2S:
    event->data.event = true;
    break;
  case INV_SENSOR_TYPE_STEP_COUNTER:
    memcpy(&(event->data.step.count), data, sizeof(event->data.step.count));
    break;
  case INV_SENSOR_TYPE_ORIENTATION:
    // we just want to copy x,y,z from orientation data
    memcpy(&(event->data.orientation), data, 3 * sizeof(float));
    break;
  case INV_SENSOR_TYPE_RAW_ACCELEROMETER:
  case INV_SENSOR_TYPE_RAW_GYROSCOPE:
    memcpy(event->data.raw3d.vect, data, sizeof(event->data.raw3d.vect));
    break;
  default:
    return false;
  }

  return true;
}

static inv_bool_t build_sensor_event(inv_device_icm20948_t *self,
    int sensorid, uint64_t timestamp, const void *data, const void *arg,
    inv_sensor_event_t *event) { // NRF_LOG_DEBUG(" build_sensor_event ");
  assert(event);

  memset(event, 0, sizeof(*event));

  (void)self;

  if (!build_sensor_event_data(self, sensorid, data, arg, event)) {
    // INV_MSG(INV_MSG_LEVEL_WARNING, "Unexpected sensor id %d. Data Ignored.", sensorid);
    return false;
  }

  /* finish up building event */
  event->sensor = sensorid;
  event->timestamp = timestamp;
  event->status = INV_SENSOR_STATUS_DATA_UPDATED;

  return true;
}